The  DimensionType  type exposes the following members.
 Methods
Name  |   Description
CanHaveEqualityFormula
 Checks whether this dimension style can have an equality formular.
CanHaveOrdinateDimensionSetting
 Checks whether this dimension style can have an ordinate dimension setting.
GetAlternateUnitsFormatOptions
 Gets the FormatOptions to optionally override the default settings in the Units class for the alternate units value.
GetEqualityFormula
 Gets dimension equality formats
GetOrdinateDimensionSetting
 Gets ordinate dimension setting
GetUnitsFormatOptions
 Gets the FormatOptions to optionally override the default settings in the Units class for the units value.
SetAlternateUnitsFormatOptions
 Sets the FormatOptions to optionally override the default settings in the Units class for the alternate units value.
SetEqualityFormula
 Sets dimension equality formats
SetOrdinateDimensionSetting
 Sets ordinate dimension setting
SetUnitsFormatOptions
 Sets the FormatOptions to optionally override the default settings in the Units class for the units value.
 See Also
  DimensionType Class
  Autodesk.Revit.DB Namespace