The  DimensionEqualityLabelFormatting  type exposes the following members.
 Constructors
Name  |   Description
DimensionEqualityLabelFormatting
 Constructs a new copy of the input DimensionEqualityLabelFormatting object.
 Methods
Name  |   Description
Dispose
 Releases all resources used by the  DimensionEqualityLabelFormatting
GetFormatOptions
 Gets format Options
IsValidFormatOptions
 Checks whether a FormatOptions object is valid for the LabelType.
SetFormatOptions
 Sets format Options
 Properties
Name  |   Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LabelType
 label type for the parameter
LeadingSpaces
 leading spaces before the parameter
Prefix
 prefix for the parameter
Suffix
 suffix for the parameter
 See Also
  DimensionEqualityLabelFormatting Class
  Autodesk.Revit.DB Namespace