The  DimensionType  type exposes the following members.
 Methods
Name  |   Description
CanHaveEqualityFormula
 Checks whether this dimension style can have an equality formular.
CanHaveOrdinateDimensionSetting
 Checks whether this dimension style can have an ordinate dimension setting.
GetAlternateUnitsFormatOptions
 Gets the FormatOptions to optionally override the default settings in the Units class for the alternate units value.
GetEqualityFormula
 Gets dimension equality formats
GetOrdinateDimensionSetting
 Gets ordinate dimension setting
GetUnitsFormatOptions
 Gets the FormatOptions to optionally override the default settings in the Units class for the units value.
SetAlternateUnitsFormatOptions
 Sets the FormatOptions to optionally override the default settings in the Units class for the alternate units value.
SetEqualityFormula
 Sets dimension equality formats
SetOrdinateDimensionSetting
 Sets ordinate dimension setting
SetUnitsFormatOptions
 Sets the FormatOptions to optionally override the default settings in the Units class for the units value.
 Properties
Name  |   Description
AlternateUnits
 The alternate units display mode for this DimensionType.
AlternateUnitsPrefix
 The prefix text for the alternate units value.
AlternateUnitsSuffix
 The suffix text for the alternate units value.
StyleType
 The dimension style type of this DimensionType.
UnitType
 The unit type of this dimension style.
 See Also
  DimensionType Class
  Autodesk.Revit.DB Namespace