The  DocumentReloadLatestProgessChangedEventArgs  type exposes the following members.
 Properties
Name  |   Description
IsMerging
 Indicates if it is merging downloaded data.
ReloadLatestFinished
 Indicates if current 'reload latest' progress is finished or not.
RetryTimes
 The number of times Revit has tried to Reload Latest. Its value is '0' at the first time.
 See Also
  DocumentReloadLatestProgessChangedEventArgs Class
  Autodesk.Revit.DB.Events Namespace