The  WorksharedOperationProgressChangedEventArgs  type exposes the following members.
 Properties
Name  |   Description
Location
 Full path of the central model which is to be operated.
Status
 Get API event status, reflect current operation execution status.
 See Also
  WorksharedOperationProgressChangedEventArgs Class
  Autodesk.Revit.DB.Events Namespace