Overload List
Name  |   Description
CreateNURBSSurface(Int32, Int32, IList Double , IList Double , IList XYZ , Boolean, BoundingBoxUV)
 Construct a BRepBuilderSurfaceGeometry based on NURBS surface data, where the weights are not supplied. In this case, the NURBS surface will be a piecewise polynomial surface.
CreateNURBSSurface(Int32, Int32, IList Double , IList Double , IList XYZ , IList Double , Boolean, BoundingBoxUV)
 Construct BRepBuilderSurfaceGeometry based on NURBS surface data, where the weights are supplied. In this case, the NURBS surface will be a piecewise rational polynomial surface.
 See Also
  BRepBuilderSurfaceGeometry Class
  BRepBuilderSurfaceGeometry Members
  Autodesk.Revit.DB Namespace