The  DimensionEqualityLabelFormatting  type exposes the following members.
 Methods
Name  |   Description
Dispose
GetFormatOptions
 Gets format Options
IsValidFormatOptions
 Checks whether a FormatOptions object is valid for the LabelType.
SetFormatOptions
 Sets format Options
 See Also
  DimensionEqualityLabelFormatting Class
  Autodesk.Revit.DB Namespace