The  AssetPropertyDistance  type exposes the following members.
 Properties
Name  |   Description
DisplayUnitType
 Unit distance.
Value
 Value of the property.
 See Also
  AssetPropertyDistance Class
  Autodesk.Revit.DB.Visual Namespace