This method marks the end of an element being exported.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
  Since:  2014
 Syntax
  C#
void OnElementEnd(
	ElementId elementId
)
  Visual Basic
Sub OnElementEnd ( _
	elementId As ElementId _
)
  Visual C++
void OnElementEnd(
	ElementId^ elementId
)
 Parameters
  elementId
 Type:  Autodesk.Revit.DB ElementId
 The Id of the element that has just been processed.
 See Also
  IExportContext Interface
  Autodesk.Revit.DB Namespace