The  LinkedResourceOpeningEventArgs  type exposes the following members.
 Properties
Name  |   Description
LinkedResourcePathName
 Path of the linked resource.
ResourceType
 The desired linked resource type.
 See Also
  LinkedResourceOpeningEventArgs Class
  Autodesk.Revit.DB.Events Namespace