The  StructuralElementDefinitionData  type exposes the following members.
 Methods
Name  |   Description
Dispose
 See Also
  StructuralElementDefinitionData Class
  Autodesk.Revit.DB.Structure.StructuralSections Namespace