The  AssetPropertyInteger  type exposes the following members.
 Properties
Name  |   Description
Value
 The value of the property.
 See Also
  AssetPropertyInteger Class
  Autodesk.Revit.DB.Visual Namespace