The  LinkedResourceOpenedEventArgs  type exposes the following members.
 Methods
Name  |   Description
 Properties
Name  |   Description
LinkedResourcePathName
 Path of the linked resource.
ResourceType
 The desired linked resource type.
 See Also
  LinkedResourceOpenedEventArgs Class
  Autodesk.Revit.DB.Events Namespace