The  VertexPositionColored  type exposes the following members.
 Properties
Name  |   Description
Position
 The vertex's position.
 See Also
  VertexPositionColored Class
  Autodesk.Revit.DB.DirectContext3D Namespace