The  AssetPropertyDouble  type exposes the following members.
 Properties
Name  |   Description
Value
 The value of the property.
 See Also
  AssetPropertyDouble Class
  Autodesk.Revit.DB.Visual Namespace