A geometry vertex specified as a position in space with a normal vector.
  Namespace:   Autodesk.Revit.DB.DirectContext3D
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
  Since:  2017
 Syntax
  C#
public class VertexPositionNormal : Vertex
  Visual Basic
Public Class VertexPositionNormal _
	Inherits Vertex
  Visual C++
public ref class VertexPositionNormal : public Vertex
 Inheritance Hierarchy
  System Object
  Autodesk.Revit.DB.DirectContext3D Vertex
  Autodesk.Revit.DB.DirectContext3D VertexPositionNormal
 See Also
  VertexPositionNormal Members
  Autodesk.Revit.DB.DirectContext3D Namespace