The  StructuralSectionAnalysisParams  type exposes the following members.
 Methods
Name  |   Description
Dispose
 See Also
  StructuralSectionAnalysisParams Class
  Autodesk.Revit.DB.Structure.StructuralSections Namespace