The  AssetPropertyBoolean  type exposes the following members.
 Properties
Name  |   Description
Value
 The value of the property.
 See Also
  AssetPropertyBoolean Class
  Autodesk.Revit.DB.Visual Namespace