The  AssetPropertyFloat  type exposes the following members.
 Properties
Name  |   Description
Value
 The value of the property.
 See Also
  AssetPropertyFloat Class
  Autodesk.Revit.DB.Visual Namespace