Checks whether a unit symbol is valid for a given display unit.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
public static bool IsValidUnitSymbol(
	DisplayUnitType displayUnit,
	UnitSymbolType unitSymbol
)
  Visual Basic
Public Shared Function IsValidUnitSymbol ( _
	displayUnit As DisplayUnitType, _
	unitSymbol As UnitSymbolType _
) As Boolean
  Visual C++
public:
static bool IsValidUnitSymbol(
	DisplayUnitType displayUnit,
	UnitSymbolType unitSymbol
)
 Parameters
  displayUnit
 Type:  Autodesk.Revit.DB DisplayUnitType
 The display unit.
  unitSymbol
 Type:  Autodesk.Revit.DB UnitSymbolType
 The unit symbol to check.
 Return Value
 True if the unit symbol is valid, false otherwise.
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions ArgumentException   |   displayUnit is an invalid display unit. See UnitUtils.IsValidDisplayUnit(DisplayUnitType) and UnitUtils.GetValidDisplayUnits().
   Autodesk.Revit.Exceptions ArgumentOutOfRangeException   |   A value passed for an enumeration argument is not a member of that enumeration
 See Also
  FormatOptions Class
  IsValidUnitSymbol Overload
  Autodesk.Revit.DB Namespace