The  InitialLuminousIntensity  type exposes the following members.
 Properties
Name  |   Description
Luminosity
 The luminosity value.
 See Also
  InitialLuminousIntensity Class
  Autodesk.Revit.DB.Lighting Namespace