Overload List
Name  |   Description
ElementMulticategoryFilter(ICollection BuiltInCategory )
 Constructs a new instance of a filter to match elements by built-in category.
ElementMulticategoryFilter(ICollection ElementId )
 Constructs a new instance of a filter to find elements whose category matches any of a given set of categories.
ElementMulticategoryFilter(ICollection BuiltInCategory , Boolean)
 Constructs a new instance of a filter to match elements by built-in category, with the option to match all elements which are not of the given category.
ElementMulticategoryFilter(ICollection ElementId , Boolean)
 Constructs a new instance of a filter to find elements whose category matches any of a given set of categories, with the option to match all elements which are of the given categories.
 See Also
  ElementMulticategoryFilter Class
  ElementMulticategoryFilter Members
  Autodesk.Revit.DB Namespace