The  EnergyAnalysisDetailModelOptions  type exposes the following members.
 Methods
Name  |   Description
Dispose
 See Also
  EnergyAnalysisDetailModelOptions Class
  Autodesk.Revit.DB.Analysis Namespace