The  CustomInitialColor  type exposes the following members.
 Properties
Name  |   Description
Temperature
 The custom color temperature value.
 See Also
  CustomInitialColor Class
  Autodesk.Revit.DB.Lighting Namespace