The  ElementIntersectsSolidFilter  type exposes the following members.
 Methods
Name  |   Description
GetSolid
 Gets the target solid geometry.
 See Also
  ElementIntersectsSolidFilter Class
  Autodesk.Revit.DB Namespace