Checks if PointCloudOverrideSettings are valid
  Namespace:   Autodesk.Revit.DB.PointClouds
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
public static bool ArePointCloudOverrideSettingsValid(
	string scanTag,
	PointCloudOverrideSettings settings
)
  Visual Basic
Public Shared Function ArePointCloudOverrideSettingsValid ( _
	scanTag As String, _
	settings As PointCloudOverrideSettings _
) As Boolean
  Visual C++
public:
static bool ArePointCloudOverrideSettingsValid(
	String^ scanTag,
	PointCloudOverrideSettings^ settings
)
 Parameters
  scanTag
 Type:  System String
 The tag identifying the particular scan within the PointCloudInstance element. Tags can be obtained from PointCloudInstance via method getScans.
  settings
 Type:  Autodesk.Revit.DB.PointClouds PointCloudOverrideSettings
 Override settings to be checked.
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions ArgumentNullException   |   A non-optional argument was NULL
 See Also
  PointCloudOverrides Class
  Autodesk.Revit.DB.PointClouds Namespace