The  TableData  type exposes the following members.
 Methods
Name  |   Description
Dispose
GetSectionData(Int32)
 Returns the section data array element at the specified index.
GetSectionData(SectionType)
 Returns the pointer to the section data array element at the specified section type.
IsEqual
 Checks if this element is equal in value to the other element.
 See Also
  TableData Class
  Autodesk.Revit.DB Namespace