Checks if elements of the given category are set to be visible in this view.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public bool GetVisibility(
	Category category
)
  Visual Basic
Public Function GetVisibility ( _
	category As Category _
) As Boolean
  Visual C++
public:
bool GetVisibility(
	Category^ category
)
 Parameters
  category
 Type:  Autodesk.Revit.DB Category
 The category.
 Return Value
 True if the category is visible, false otherwise.
 Remarks
 This checks only if the category is set visible or invisible individually. Other Revit mechanisms may also affect the visibility of elements of this category, including:
 the category classes settings for model categories, annotation categories, import categories or analytical model categories.
 view filters
 Thus the return value may not reflect the actual visibility of elements of this category in the view.
 See Also
  View Class
  Autodesk.Revit.DB Namespace