The  ElementStructuralTypeFilter  type exposes the following members.
 Properties
Name  |   Description
StructuralType
 The structural type.
 See Also
  ElementStructuralTypeFilter Class
  Autodesk.Revit.DB Namespace