The  IFCAggregate  type exposes the following members.
 Methods
Name  |   Description
Add
 Adds an element to the aggregate.
AddAggregate
 Creates a nested aggregate and adds it to the aggregate.
Delete
 Delete the aggregate object from the IFCFile model.
Dispose
 Releases all resources used by the  IFCAggregate
GetBasicIEnumerator
 Returns an enumerator that iterates through a collection.
GetEnumerator
 Returns an enumerator that iterates through the collection.
GetIFCAggregateIterator
 Returns a IFCAggregateIterator that iterates through the collection.
 Properties
Name  |   Description
Count
 The number of the data values in the aggregate.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Item
 See Also
  IFCAggregate Class
  Autodesk.Revit.DB.IFC Namespace