The  RenderingImageExposureSettings  type exposes the following members.
 Properties
Name  |   Description
ExposureValue
 The value of rendering image exposure.
Highlights
 The highlights value.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
MidTones
 The midtones value.
Saturation
 The value of rendering image saturation.
Shadows
 The shadows value.
WhitePoint
 The white point value.
 See Also
  RenderingImageExposureSettings Class
  Autodesk.Revit.DB Namespace