The  PipeType  type exposes the following members.
 Methods
Name  |   Description
 Properties
Name  |   Description
Class
 The schedule type of the pipe type.
 See Also
  PipeType Class
  Autodesk.Revit.DB.Plumbing Namespace