The  ColorBackgroundSettings  type exposes the following members.
 Properties
Name  |   Description
Color
 The color of the rendering background.
 See Also
  ColorBackgroundSettings Class
  Autodesk.Revit.DB Namespace