The  BuildingEnvelopeAnalyzerOptions  type exposes the following members.
 Methods
Name  |   Description
Dispose
 See Also
  BuildingEnvelopeAnalyzerOptions Class
  Autodesk.Revit.DB.Analysis Namespace