The  ModelPath  type exposes the following members.
 Properties
Name  |   Description
CentralServerPath
 A path to the location of the central Revit server.
Empty
 Whether this path is empty
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ServerPath
 Whether this path is a server path (as opposed to a file path or cloud path)
 See Also
  ModelPath Class
  Autodesk.Revit.DB Namespace