The  ElementDesignOptionFilter  type exposes the following members.
 Properties
Name  |   Description
DesignOptionId
 The design option id.
 See Also
  ElementDesignOptionFilter Class
  Autodesk.Revit.DB Namespace