Creates a new FormatOptions object that represents custom formatting.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
public FormatOptions(
	DisplayUnitType displayUnit,
	UnitSymbolType unitSymbol,
	double accuracy
)
  Visual Basic
Public Sub New ( _
	displayUnit As DisplayUnitType, _
	unitSymbol As UnitSymbolType, _
	accuracy As Double _
)
  Visual C++
public:
FormatOptions(
	DisplayUnitType displayUnit,
	UnitSymbolType unitSymbol,
	double accuracy
)
 Parameters
  displayUnit
 Type:  Autodesk.Revit.DB DisplayUnitType
 The display unit.
  unitSymbol
 Type:  Autodesk.Revit.DB UnitSymbolType
 The unit symbol.
  accuracy
 Type:  System Double
 The accuracy.
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions ArgumentException   |   displayUnit is an invalid display unit. See UnitUtils.IsValidDisplayUnit(DisplayUnitType) and UnitUtils.GetValidDisplayUnits(). -or- unitSymbol is not a valid unit symbol for displayUnit. -or- accuracy is not a valid accuracy for displayUnit.
   Autodesk.Revit.Exceptions ArgumentOutOfRangeException   |   A value passed for an enumeration argument is not a member of that enumeration
 See Also
  FormatOptions Class
  FormatOptions Overload
  Autodesk.Revit.DB Namespace