The  RebarConstrainedHandle  type exposes the following members.
 Methods
Name  |   Description
Dispose
GetEdgeNumber
 If the RebarConstrainedHandle's RebarHandleType is 'Edge,' then this function will return the number of the edge that is driven by the handle.
GetHandleType
 Returns the RebarHandleType of a RebarConstrainedHandle.
IsEdgeHandle
 Returns true if the RebarHandleType of the RebarConstrainedHandle is 'Edge.'
IsValid
 Checks that the RebarConstrainedHandle still has access to valid Rebar handle data and that its RebarConstraintsManager is still valid.
 See Also
  RebarConstrainedHandle Class
  Autodesk.Revit.DB.Structure Namespace