The  ElectricalSetting  type exposes the following members.
 Methods
Name  |   Description
AddDistributionSysType
 Add a new distribution system type to project.
AddVoltageType
 Add a new type definition of voltage into project.
AddWireMaterialType
 Add a new type of wire material.
AddWireType
 Add a new wire type to project.
GetElectricalSettings
 Get the electrical settings of the project.
GetSpecificFittingAngles
 Gets the list of specific fitting angles.
GetSpecificFittingAngleStatus
 Gets the status of given specific fitting angle.
IsValidSpecificFittingAngle
 Checks that the given value is a valid specific fitting angle. The specific fitting angles are angles of 90, 60, 45, 30, 22.5 or 11.25 degrees.
RemoveDistributionSysType
 Remove an existing distribution system type from the project.
RemoveVoltageType
 Remove the voltage type from project.
RemoveWireMaterialType
 Remove the wire material type from project.
RemoveWireType
 Remove wire type definition from project.
SetSpecificFittingAngleStatus
 Sets the status of given specific angle.
 See Also
  ElectricalSetting Class
  Autodesk.Revit.DB.Electrical Namespace