The  DocumentPrintingEventArgs  type exposes the following members.
 Properties
Name  |   Description
Settings
 The print settings of the active printing session.
 See Also
  DocumentPrintingEventArgs Class
  Autodesk.Revit.DB.Events Namespace