The  Panel  type exposes the following members.
 Properties
Name  |   Description
Lockable
 This property is used to know whether a panel can be locked.
Transform
 This property is used to find the transform of a curtain panel within project.
 See Also
  Panel Class
  Autodesk.Revit.DB Namespace