Identifies if a leader is displayed for the tag.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public bool HasLeader { get; set; }
  Visual Basic
Public Property HasLeader As Boolean
	Get
	Set
  Visual C++
public:
property bool HasLeader {
	bool get ();
	void set (bool value);
}
 Field Value
 True if a leader is displayed, otherwise false.
 See Also
  SpatialElementTag Class
  Autodesk.Revit.DB Namespace