The  ElementIntersectsElementFilter  type exposes the following members.
 Methods
Name  |   Description
GetElement
 Gets the target element.
 See Also
  ElementIntersectsElementFilter Class
  Autodesk.Revit.DB Namespace