The  PhotometricWebLightDistribution  type exposes the following members.
 Properties
Name  |   Description
PhotometricWebFile
 The filename of an IES photometric web file.
TiltAngle
 The tilt angle.
 See Also
  PhotometricWebLightDistribution Class
  Autodesk.Revit.DB.Lighting Namespace