The  ElectricalDemandFactorValue  type exposes the following members.
 Methods
Name  |   Description
Dispose
SetMaxRangeToUnlimited
 Sets the max range on the value to unlimited
 See Also
  ElectricalDemandFactorValue Class
  Autodesk.Revit.DB.Electrical Namespace