Overload List
Name  |   Description
CopyElements(Document, ICollection ElementId , XYZ)
 Copies a set of elements and places the copies at a location indicated by a given translation.
CopyElements(Document, ICollection ElementId , Document, Transform, CopyPasteOptions)
 Copies a set of elements from source document to destination document.
CopyElements(View, ICollection ElementId , View, Transform, CopyPasteOptions)
 Copies a set of elements from source view to destination view.
 See Also
  ElementTransformUtils Class
  ElementTransformUtils Members
  Autodesk.Revit.DB Namespace