Overload List
Name  |   Description
GetElement(String)
 Gets the Element referenced by a unique id string.
GetElement(ElementId)
 Gets the Element referenced by the input string name.
GetElement(Reference)
 Gets the Element referenced by the input reference.
 See Also
  Document Class
  Document Members
  Autodesk.Revit.DB Namespace