The  TopographyEditScope  type exposes the following members.
 Constructors
Name  |   Description
TopographyEditScope
 Instantiates a TopographyEditScope object.
 Methods
Name  |   Description
Start
 Starts a topography surface edit mode for an existing TopographySurface element.
 Properties
Name  |   Description
IsPermitted
 Tests if the TopographyEditScope is permitted to start.
 See Also
  TopographyEditScope Class
  Autodesk.Revit.DB.Architecture Namespace