The  PipeFittingAndAccessoryPressureDropItem  type exposes the following members.
 Methods
Name  |   Description
Dispose
 See Also
  PipeFittingAndAccessoryPressureDropItem Class
  Autodesk.Revit.DB.Plumbing Namespace