The  AnalysisDisplayColorEntry  type exposes the following members.
 Methods
Name  |   Description
Dispose
HasValue
 Check if color entry has associated value.
IsEqual
 Compare color entries.
 See Also
  AnalysisDisplayColorEntry Class
  Autodesk.Revit.DB.Analysis Namespace