The  ComboBoxMemberData  type exposes the following members.
 Properties
Name  |   Description
GroupName
 Gets or sets a group name for the ComboBoxMember.
Image
 The image shown on the ComboBoxMember.
Text
 The user-visible text of the ComboBoxMember.
 See Also
  ComboBoxMemberData Class
  Autodesk.Revit.UI Namespace