The identifier of the Schema.
  Namespace:   Autodesk.Revit.DB.ExtensibleStorage
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
public Guid GUID { get; }
  Visual Basic
Public ReadOnly Property GUID As Guid
	Get
  Visual C++
public:
property Guid GUID {
	Guid get ();
}
 See Also
  Schema Class
  Autodesk.Revit.DB.ExtensibleStorage Namespace