Duplicates an existing element type and assigns it a new name.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public ElementType Duplicate(
	string name
)
  Visual Basic
Public Function Duplicate ( _
	name As String _
) As ElementType
  Visual C++
public:
ElementType^ Duplicate(
	String^ name
)
 Parameters
  name
 Type:  System String
 The new name of the element type.
 Return Value
 The duplicated element type.
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions ArgumentException   |   name is an empty string. -or- name cannot include prohibited characters. -or- The element type name was empty, contained invalid characters, or was invalid for the specific element type. -or- The name is already in use for this element type.
   Autodesk.Revit.Exceptions ArgumentNullException   |   A non-optional argument was NULL
 See Also
  ElementType Class
  Autodesk.Revit.DB Namespace