The  FabricSheetType  type exposes the following members.
 Methods
Name  |   Description
CreateDefaultFabricSheetType
 Creates a new FabricSheetType object with a default name.
GetReinforcementRoundingManager
 Returns an object for managing reinforcement rounding override settings.
IsValidMajorLapSplice
 Identifies if the input value is valid to be applied as the major lap splice value for this FabricSheetType.
IsValidMinorLapSplice
 Identifies if the input value is valid to be applied as the minor lap splice value for this FabricSheetType.
SetMajorLayoutAsActualSpacing
 Sets the major layout pattern as ActualSpacing, while specifying the needed parameters for this pattern.
SetMajorLayoutAsFixedNumber
 Sets the major layout pattern as FixedNumber, while specifying the needed parameters for this pattern.
SetMajorLayoutAsMaximumSpacing
 Sets the major layout pattern as MaximumSpacing, while specifying the needed parameters for this pattern.
SetMajorLayoutAsNumberWithSpacing
 Sets the major layout pattern as NumberWithSpacing, while specifying the needed parameters for this pattern.
SetMinorLayoutAsActualSpacing
 Sets the minor layout pattern as ActualSpacing, while specifying the needed parameters for this pattern.
SetMinorLayoutAsFixedNumber
 Sets the major layout pattern as FixedNumber, while specifying the needed parameters for this pattern.
SetMinorLayoutAsMaximumSpacing
 Sets the major layout pattern as MaximumSpacing, while specifying the needed parameters for this pattern.
SetMinorLayoutAsNumberWithSpacing
 Sets the major layout pattern as NumberWithSpacing, while specifying the needed parameters for this pattern.
 See Also
  FabricSheetType Class
  Autodesk.Revit.DB.Structure Namespace