The  FamilyInstanceFilter  type exposes the following members.
 Properties
Name  |   Description
FamilySymbolId
 The family symbol id.
 See Also
  FamilyInstanceFilter Class
  Autodesk.Revit.DB Namespace