The  SiteSubRegion  type exposes the following members.
 Methods
Name  |   Description
Create(Document, IList CurveLoop )
 Creates a new SiteSubRegion element and adds it to the document.
Create(Document, IList CurveLoop , ElementId)
 Creates a new SiteSubRegion element with assigned TopographySurface to be hosted and adds it to the document.
Dispose
GetBoundary
 Gets the boundary of current subregion.
IsValidBoundary
 Identifies whether the given curve loops compose a valid boundary.
SetBoundary
 Set the given curve loops as the boundary of an existing SiteSubRegion.
 See Also
  SiteSubRegion Class
  Autodesk.Revit.DB.Architecture Namespace