The  CentralModelContentionException  type exposes the following members.
 Methods
Name  |   Description
GetObjectData
 Retrieves data needed to serialize the target object.
 (Overrides  CentralModelException GetObjectData(SerializationInfo, StreamingContext)  .)
 Properties
Name  |   Description
 See Also
  CentralModelContentionException Class
  Autodesk.Revit.Exceptions Namespace