The  CurveElementFilter  type exposes the following members.
 Properties
Name  |   Description
CurveElementType
 The curve element type.
 See Also
  CurveElementFilter Class
  Autodesk.Revit.DB Namespace