Overload List
Name  |   Description
Create(Document, IList CurveLoop )
 Creates a new SiteSubRegion element and adds it to the document.
Create(Document, IList CurveLoop , ElementId)
 Creates a new SiteSubRegion element with assigned TopographySurface to be hosted and adds it to the document.
 See Also
  SiteSubRegion Class
  SiteSubRegion Members
  Autodesk.Revit.DB.Architecture Namespace