Determines whether Revit should save the link, not save the link, or discard shared positioning entirely.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
SaveModifiedLinksOptions GetSaveModifiedLinksOption(
	RevitLinkType link
)
  Visual Basic
Function GetSaveModifiedLinksOption ( _
	link As RevitLinkType _
) As SaveModifiedLinksOptions
  Visual C++
SaveModifiedLinksOptions GetSaveModifiedLinksOption(
	RevitLinkType^ link
)
 Parameters
  link
 Type:  Autodesk.Revit.DB RevitLinkType
 The Revit link which has modified shared coordinates.
 See Also
  ISaveSharedCoordinatesCallback Interface
  Autodesk.Revit.DB Namespace