The  AppearanceAssetElement  type exposes the following members.
 Methods
Name  |   Description
Create
 Creates a new AppearancAssetElement.
GetAppearanceAssetElementByName
 Gets an AppearanceAssetElement by name.
GetRenderingAsset
 Gets the rendering asset for the appearance asset element.
SetRenderingAsset
 Sets the rendering asset for the appearance asset element.
 Properties
Name  |   Description
 See Also
  AppearanceAssetElement Class
  Autodesk.Revit.DB Namespace