The  ExternalResourceBrowserData  type exposes the following members.
 Properties
Name  |   Description
FolderPath
 The current folder path to which the new resources and sub folder belong.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ServerId
 The Id of IExternalResourceServer which handles the external resource load.
 See Also
  ExternalResourceBrowserData Class
  Autodesk.Revit.DB Namespace