The  PromptForFamilyInstancePlacementOptions  type exposes the following members.
 Methods
Name  |   Description
Dispose
 See Also
  PromptForFamilyInstancePlacementOptions Class
  Autodesk.Revit.UI Namespace