The  StructuralSectionsServiceData  type exposes the following members.
 Constructors
Name  |   Description
StructuralSectionsServiceData
 Constructs a new instance of SectionTypeParameterServiceData.
 Methods
Name  |   Description
Dispose
 Releases all resources used by the  StructuralSectionsServiceData
GetCurrentElements
 Returns the list of Ids of the current elements.
 Properties
Name  |   Description
Document
 The current document.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 See Also
  StructuralSectionsServiceData Class
  Autodesk.Revit.DB.Structure Namespace