The  AssemblyMemberDifferentType  type exposes the following members.
 Properties
Name  |   Description
TypeId1
 Type id of the first assembly member
TypeId2
 Type id of the second assembly member
 See Also
  AssemblyMemberDifferentType Class
  Autodesk.Revit.DB Namespace