The  DuctFittingAndAccessoryPressureDropItem  type exposes the following members.
 Methods
Name  |   Description
Dispose
 See Also
  DuctFittingAndAccessoryPressureDropItem Class
  Autodesk.Revit.DB.Mechanical Namespace