The  InitialFluxIntensity  type exposes the following members.
 Properties
Name  |   Description
Flux
 The flux intensity value.
 See Also
  InitialFluxIntensity Class
  Autodesk.Revit.DB.Lighting Namespace