Checks whether the category can have graphic overrides in this view.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  Since:  2014
 Syntax
  C#
public bool IsCategoryOverridable(
	ElementId categoryId
)
  Visual Basic
Public Function IsCategoryOverridable ( _
	categoryId As ElementId _
) As Boolean
  Visual C++
public:
bool IsCategoryOverridable(
	ElementId^ categoryId
)
 Parameters
  categoryId
 Type:  Autodesk.Revit.DB ElementId
 ElementId of the category.
 Return Value
 True if category can be overridden, false otherwise.
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions ArgumentNullException   |   A non-optional argument was NULL
 See Also
  View Class
  Autodesk.Revit.DB Namespace