The  StructuralSectionISplitSlopedFlange  type exposes the following members.
 Constructors
Name  |   Description
StructuralSectionISplitSlopedFlange
 Creates a new instance of Structural Section I Split Sloped Flange shape with the associated set of parameters, used to attach to structural element.
 Methods
Name  |   Description
 Properties
Name  |   Description
BoltDiameter
 Maximum bolt hole diameter, in. (mm)
BoltSpacing
 Standard bolt spacing, in. (mm)
ClearWebHeight
 Detailing depth between the web toes of the fillets, in.(mm)
FlangeFillet
 Flange Fillet - fillet radius at the flange end.
WebToeOfFillet
 Detailing distance from outer face of flange to web toe of fillet, in. (mm)
 See Also
  StructuralSectionISplitSlopedFlange Class
  Autodesk.Revit.DB.Structure.StructuralSections Namespace