The  StructuralSectionStructuralTees  type exposes the following members.
 Properties
Name  |   Description
BoltDiameter
 Maximum bolt hole diameter, in. (mm)
BoltSpacing
 Standard bolt spacing in the flange, in. (mm)
BoltSpacingWeb
 Standard bolt spacing in the web, in. (mm)
FlangeFillet
 Flange Fillet - fillet radius at the flange end.
 See Also
  StructuralSectionStructuralTees Class
  Autodesk.Revit.DB.Structure.StructuralSections Namespace