The  DuctLiningType  type exposes the following members.
 Properties
Name  |   Description
Roughness
 The roughness of Duct Lining.
 See Also
  DuctLiningType Class
  Autodesk.Revit.DB.Mechanical Namespace