The  Point  type exposes the following members.
 Methods
Name  |   Description
Create(XYZ)
 Creates a point at the given coordinates.
Create(XYZ, ElementId)
 Creates a point at the given coordinates and assigns it the specified color.
 See Also
  Point Class
  Autodesk.Revit.DB Namespace