The  StructuralSectionISplitParallelFlange  type exposes the following members.
 Constructors
Name  |   Description
StructuralSectionISplitParallelFlange
 Creates a new instance of Structural Section I Split Parallel Flange shape with the associated set of parameters, used to attach to structural element.
 Methods
Name  |   Description
 Properties
Name  |   Description
BoltDiameter
 Maximum bolt hole diameter, in. (mm)
BoltSpacing
 Standard bolt spacing, in. (mm)
ClearWebHeight
 Detailing depth between the web toes of the fillets, in.(mm)
FlangeToeOfFillet
 Detailing distance from center of web to flange toe of fillet, in. (mm)
WebToeOfFillet
 Detailing distance from outer face of flange to web toe of fillet, in. (mm)
 See Also
  StructuralSectionISplitParallelFlange Class
  Autodesk.Revit.DB.Structure.StructuralSections Namespace