The  ParameterValue  type exposes the following members.
 Methods
Name  |   Description
Copy
 Makes an identical copy of the given parameter value.
Dispose
IsEqual
 Tests equality with another instance of the same class.
IsSameType
 Tests another instance is of the same value type.
 See Also
  ParameterValue Class
  Autodesk.Revit.DB Namespace