Identifies the segment length rounding method
  Namespace:   Autodesk.Revit.DB.Structure
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  Since:  2016
 Syntax
  C#
public RoundingMethod SegmentLengthRoundingMethod { get; set; }
  Visual Basic
Public Property SegmentLengthRoundingMethod As RoundingMethod
	Get
	Set
  Visual C++
public:
property RoundingMethod SegmentLengthRoundingMethod {
	RoundingMethod get ();
	void set (RoundingMethod value);
}
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions ArgumentOutOfRangeException   |   When setting this property: A value passed for an enumeration argument is not a member of that enumeration
   Autodesk.Revit.Exceptions DisabledDisciplineException   |   When setting this property: None of the following disciplines is enabled: Structural.
 See Also
  RebarRoundingManager Class
  Autodesk.Revit.DB.Structure Namespace