The  MemberForcesServiceData  type exposes the following members.
 Constructors
Name  |   Description
MemberForcesServiceData
 Constructs a new instance of MemberForcesParameterServiceData.
 Methods
Name  |   Description
Dispose
 Releases all resources used by the  MemberForcesServiceData
GetCurrentElements
 Returns the list of Ids of the current elements.
 Properties
Name  |   Description
Document
 The current document.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 See Also
  MemberForcesServiceData Class
  Autodesk.Revit.DB.Structure Namespace