Overload List
Name  |   Description
Create(XYZ)
 Creates a point at the given coordinates.
Create(XYZ, ElementId)
 Creates a point at the given coordinates and assigns it the specified color.
 See Also
  Point Class
  Point Members
  Autodesk.Revit.DB Namespace