ExtraCheckBoxText is used to label the extra checkbox.
  Namespace:   Autodesk.Revit.UI
  Assembly:   RevitAPIUI  (in RevitAPIUI.dll) Version: 17.0.0.0 (17.0.484.0)
  Since:  2017
 Syntax
  C#
public string ExtraCheckBoxText { get; set; }
  Visual Basic
Public Property ExtraCheckBoxText As String
	Get
	Set
  Visual C++
public:
property String^ ExtraCheckBoxText {
	String^ get ();
	void set (String^ value);
}
 Remarks
 If ExtraCheckBoxText is set, a checkbox with the text will be shown. You can get the response of checkbox by checking the return value of the WasExtraCheckBoxChecked() method.
 See Also
  TaskDialog Class
  Autodesk.Revit.UI Namespace