The  DocumentPrintingEventArgs  type exposes the following members.
 Methods
Name  |   Description
GetSettings
 Gets the print settings of the active printing session.
GetViewElementIds
 Returns ElementIds of the views to be printed.
 Properties
Name  |   Description
Settings   |     Obsolete.
 The print settings of the active printing session.
 See Also
  DocumentPrintingEventArgs Class
  Autodesk.Revit.DB.Events Namespace