The  DialogBoxShowingEventArgs  type exposes the following members.
 Methods
Name  |   Description
OverrideResult
 Call this method to cause the Autodesk Revit dialog to be dismissed with the specified return value.
 Properties
Name  |   Description
DialogId
 A unique string identifier for DialogBox and TaskDialog type dialogs in Revit.
HelpId   |     Obsolete.
 An ID that represents the dialog that has been displayed.
 See Also
  DialogBoxShowingEventArgs Class
  Autodesk.Revit.UI.Events Namespace