Creates a new wire.
  Namespace:   Autodesk.Revit.DB.Electrical
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
  Since:  2015
 Syntax
  C#
public static Wire Create(
	Document document,
	ElementId wireTypeId,
	ElementId viewId,
	WiringType wiringType,
	IList<XYZ> vertexPoints,
	Connector startConnectorTo,
	Connector endConnectorTo
)
  Visual Basic
Public Shared Function Create ( _
	document As Document, _
	wireTypeId As ElementId, _
	viewId As ElementId, _
	wiringType As WiringType, _
	vertexPoints As IList(Of XYZ), _
	startConnectorTo As Connector, _
	endConnectorTo As Connector _
) As Wire
  Visual C++
public:
static Wire^ Create(
	Document^ document,
	ElementId^ wireTypeId,
	ElementId^ viewId,
	WiringType wiringType,
	IList<XYZ^>^ vertexPoints,
	Connector^ startConnectorTo,
	Connector^ endConnectorTo
)
 Parameters
  document
 Type:  Autodesk.Revit.DB Document
 The document.
  wireTypeId
 Type:  Autodesk.Revit.DB ElementId
 The id of the wire type of the newly created wire.
  viewId
 Type:  Autodesk.Revit.DB ElementId
 The view in which the wire is to be visible. This must be the id of a floor plan or reflected ceiling plan view.
  wiringType
 Type:  Autodesk.Revit.DB.Electrical WiringType
 Specifiies the wiring type for the newly created wire. The shape of the wire is determined by this value and the total number of points supplied via the vertexPoints and endpoint connectors. If the wiring type is WiringType.Arc:
 If there are 2 total points supplied, the wire is a straight-line wire.
 If there are 3 total points supplied, the wire is a circular arc wire.
 If there are 4 or more points, the wire is a spline wire.
 If the wiring type is WiringType.Chamfer, a polyline wire will be created connecting all the points.
  vertexPoints
 Type:  System.Collections.Generic IList   XYZ
 The vertex point of the wire. If the startConnectorTo is    a null reference (  Nothing  in Visual Basic)  , the first vertex of the vertexPoints will be the start point, otherwise, the start connector origin will be the start point. If the endConnectorTo is    a null reference (  Nothing  in Visual Basic)  , the last vertex of the vertexPoints will be the end point, otherwise, the end connector origin will be the end point.
  startConnectorTo
 Type:  Autodesk.Revit.DB Connector
 The connector to which the wire start point connects. If    a null reference (  Nothing  in Visual Basic)  , the start point connects to no existing connector. If set with a connector, the connector's origin will be added to the wire's vertices as the start point.
  endConnectorTo
 Type:  Autodesk.Revit.DB Connector
 The connector to which the wire end point connects. If    a null reference (  Nothing  in Visual Basic)  , the end point connects to no existing connector. If set with a connector, the connector's origin will be added to the wire's vertices as the end point.
 Return Value
 The wire created.
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions ArgumentException   |   wireTypeId is not a valid WireType id. -or- viewId does not represent a view valid for a Wire element. Either a floor plan or reflected ceiling plan is expected. -or- vertexPoints is not valid, because one or more points are coincident by comparing the X and Y of the points, or there are not at least two points including the connectors. -or- startConnectorTo cannot be connected to a wire, as it is not an electrical connector. -or- endConnectorTo cannot be connected to a wire, as it is not an electrical connector.
   Autodesk.Revit.Exceptions ArgumentNullException   |   A non-optional argument was NULL
   Autodesk.Revit.Exceptions ArgumentOutOfRangeException   |   A value passed for an enumeration argument is not a member of that enumeration
   Autodesk.Revit.Exceptions DisabledDisciplineException   |   None of the following disciplines is enabled: Mechanical Electrical Piping.
 See Also
  Wire Class
  Autodesk.Revit.DB.Electrical Namespace