The  RebarReinforcementData  type exposes the following members.
 Methods
Name  |   Description
Create
 Creates a new instance of RebarReinforcementData, or    a null reference (  Nothing  in Visual Basic)  if the operation fails.
 See Also
  RebarReinforcementData Class
  Autodesk.Revit.DB.Structure Namespace