The  PanelScheduleSheetInstance  type exposes the following members.
 Properties
Name  |   Description
Origin
 The sheet instance offset in drawing sheet coordinates.
ScheduleId
 The panel schedule id.
 See Also
  PanelScheduleSheetInstance Class
  Autodesk.Revit.DB.Electrical Namespace