The  BoundaryConditions  type exposes the following members.
 Properties
Name  |   Description
AssociatedLoadId
 The Id of the internal load element associated with a boundary conditions.
HostElement
 The host element for the boundary conditions.
HostElementId
 The host element Id for the boundary conditions.
Point
 Returns the position of point boundary conditions.
 See Also
  BoundaryConditions Class
  Autodesk.Revit.DB.Structure Namespace