Provides a container of all Revit built-in FailureDefinitionId instances.
 The  BuiltInFailures StructuralConnectionFailures  type exposes the following members.
 Properties
Name  |   Description
StructuralConnectionCannotGenerate
 Could not create Structural Connection Handler
StructuralConnectionCannotReplaceRefs
 Structural Connection cannot replace elements
StructuralConnectionNoSingleRef
 Summary: Structural Connection Handler lost connected element.
StructuralConnectionNotEnoughRefs
 Structural Connection Handler cannot connect fewer than two elements.
StructuralConnectionTooFarNotEnoughRefs
 Structural Connection Handler cannot connect too far elements
StructuralConnectionTooFarRefs
 Structural Connection Handler cannot connect too far elements
StructuralConnectionTypeChangedToGeneric
 Structural Connection had an inappropriate type, which has been changed to 'Generic Connection'.
StructuralConnectionTypeInfoNotAvailable
 There is no add-on installed which supports Structural Connection type.
StructuralConnectionWrongType
 Structural Connection has an inappropriate type assigned.
 See Also
  BuiltInFailures StructuralConnectionFailures Class
  Autodesk.Revit.DB Namespace