The  FabricationHostedInfo  type exposes the following members.
 Methods
Name  |   Description
DisconnectFromHost
 Disconnects the part from the host.
Dispose
 Releases all resources used by the  FabricationHostedInfo
GetBearerCenterline
 Gets the centerline of the bearer. The method is applicable only for bearer hanger.
PlaceOnHost
 Places the part on the specified host.
 Properties
Name  |   Description
HostId
 Returns the Id of the host.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 See Also
  FabricationHostedInfo Class
  Autodesk.Revit.DB Namespace