The  DirectShape  type exposes the following members.
 Methods
Name  |   Description
AppendShape(IList GeometryObject )
 Appends the collection of Geometry objects into the model shape representation stored in this DirectShape.
AppendShape(ShapeBuilder)
 Appends shape built by the supplied ShapeBuilderObject to shape representation stored in this DirectShape. The data stored in the supplied ShapeBuilder object will be cleared.
AppendShape(IList GeometryObject , DirectShapeTargetViewType)
 Appends the collection of Geometry objects into the model or view specific shape representation stored in this DirectShape. Passing DirectShapeTargetViewType.Default as view type will cause the model shape to be updated.
AreOptionsValid
 Validates that the given DirectShapeOptions are allowed for this particular DirectShape.
AreOptionsValidForTransientDirectShape
 Validates that the given DirectShapeOptions are allowed if this DirectShape is transient.
CreateElement(Document, ElementId)
 Creates a DirectShape object and adds it to document.
CreateElement(Document, ElementId, String, String)   |     Obsolete.
 Creates a DirectShape object and adds it to document.
CreateElementInstance(Document, ElementId, ElementId, String, Transform)
 Creates a DirectShape object and adds it to document.
CreateElementInstance(Document, ElementId, ElementId, String, Transform, String, String)   |     Obsolete.
 Creates a DirectShape object and adds it to document. The shape stored in the element is either a reference or a copy of a definition shape that was created earlier. How the definitions are stored will determine whether an instance or a copy of the shape will be created. See DirectShapeLibrary for more details. This function is included for convenience. It essentially combines CreateGeometryInstance and CreateElement.
CreateGeometryInstance
 Creates a copy of a definition shape that was created earlier.
GetOptions
 Gets a copy of the current options for this DirectShape.
IsSupportedDocument
 Tests whether a DirectShape or a DirectShapeType may be created in this document.
IsValidCategoryId
 Test the category id to make sure it is indeed a top-level built-in category.
IsValidGeometry
 Validates geometry to be stored in a DirectShape. Suitable geometry validation is performed. Additionally, the geometry must make sense as a shape representation for the category assigned to this DirectShape object.
IsValidShape(IList GeometryObject )
 Validates shape to be stored in a DirectShape. Supercedes and extends IsValidGeometry().
IsValidShape(IList GeometryObject , DirectShapeTargetViewType)
 Validates view-specific shape to be stored in a DirectShape. Expects a non-default view type.
IsValidTypeId
 Tests the type id to make sure it satisfies the following conditions It is a valid element id.It corresponds to a valid DirectShapeType.The DirectShapeType has the same category assigned. Additionally, this functions tests that the current type id in this DirectShape is invalid. The type id is initialized to invalidElementId by the create functions. Once it is set, it may no longer be changed.
SetGUIDs   |     Obsolete.
 Sets the GUID of the application that has created this DirectShape element and the GUID of the native data that was the source of this DirectShape.
SetName
 Sets the name for the DirectShape element.
SetOptions
 Sets the options to use for this DirectShape.
SetShape(IList GeometryObject )
 Builds the shape of this object from the supplied collection of Geometry objects. The objects are copied. If the new shape is identical to the old one, the old shape will be kept.
SetShape(ShapeBuilder)
 Sets the shape of this object to the one accumulated in the supplied Builder object. If the new shape is identical to the old one, the old shape will be kept.
SetShape(IList GeometryObject , DirectShapeTargetViewType)
 Builds the shape of this object from the supplied collection of Geometry objects. The objects are copied. If the new shape is identical to the old one, the old shape will be kept.
SetTypeId
 Sets the DirectShapeType for the DirectShape element.
 See Also
  DirectShape Class
  Autodesk.Revit.DB Namespace